//
// Created by jakim on 12/6/2025.
/*
Да се напише програма во која во даден опсег на природни броеви [a,b],
ќе се најдат и отпечатат сите броеви чијшто збир на цифри кои се деливи со 2,
но НЕ се деливи со 3, е поголем од 0 и е делив со 7. На крај да се отпечати и бројот на вакви броеви.
 */
/*
Test cases:
2000 4000
2048
2084
2148
2184
2228
2282
2348
2384
2408
2418
2438
2444
2458
2468
2478
2480
2481
2483
2485
2486
2487
2489
2498
2548
2584
2648
2684
2748
2784
2804
2814
2822
2834
2840
2841
2843
2845
2846
2847
2849
2854
2864
2874
2894
2948
2984
3248
3284
3428
3482
3824
3842
Vkupno: 52

1200 2000
1248
1284
1428
1482
1824
1842
Vkupno: 6

10 70
Vkupno: 0

10 20
Vkupno: 0

200 1500
248
284
428
482
824
842
1248
1284
1428
1482
Vkupno: 10

10 900
248
284
428
482
824
842
Vkupno: 6
 */
//
#include <iostream>

using namespace std;

int main() {
    int a, b;
    cin >> a >> b;
    int counter = 0;
    for (int i = a; i <= b; i++) {
        int zbirCifri = 0;
        int broj = i;
        while (broj > 0) {
            int cifra = broj % 10;
            //delivi so 2, NE delivi so 3
            if (cifra % 2 == 0 && cifra % 3 != 0) {
                zbirCifri += broj % 10;
            }
            broj /= 10;
        }
        if (zbirCifri > 0 && zbirCifri % 7 == 0) {
            cout << i << endl;
            counter++;
        }
    }
    cout << "Vkupno: " << counter << endl;
}
