//
// Created by jakim on 12/6/2025.
/*
Еден пајак секогаш ја плете својата мрежа на ист начин.
Така, тој плете по сите страни на еден квадрат и по неговата
споредна дијагонала. Ако при влез од тастатура се внесе број n кој
е поголем или еднаков на 5, испечатете ја мрежата која би ја сплетил пајакот.
Пример, кога n=5:
    *****
    *  **
    * * *
    **  *
    *****


Input: 12
Result:
************
*         **
*        * *
*       *  *
*      *   *
*     *    *
*    *     *
*   *      *
*  *       *
* *        *
**         *
************

 */
//
#include "iostream"

using namespace std;

int main() {
    int n;
    cin >> n;
    if (n <= 2) {
        cout << "Nevaliden vlez" << endl;
        return 0;
    }
    for (int i = 0; i < n; i++) {
        for (int j = 0; j < n; j++) {
            if (i == 0 || i == n - 1 || j == 0 || j == n - 1 || i + j == n - 1) {
                cout << "*";
            } else {
                cout << " ";
            }
        }
        cout << endl;
    }
}
