//
// Created by jakim on 12/7/2025.
/*
Да се напише програма која ќе го пресмета скаларниот производ на два вектори со по n координати.
Бројот на координати n, како и координатите на векторите се внесуваат од стандарден влез.
Резултатот да се испечати на екран.
*За вектори A и B со по три броја — тие броеви се нивните координати, на пример:
A = (2, 4, 6)
B = (1, 3, 5)

Скалaрниот производ се добива така што се множат секој соодветен пар броеви и се собираат резултатите:
-> 2·1 + 4·3 + 6·5 = 2 + 12 + 30 = 44
 */
//
