//
// Created by jakim on 12/7/2025.
/*
Дефинираме вредност d за тројка цели броеви a, b и c , така што таа се пресметува како сума меѓу
апсолутните разлики од првиот и вториот број, од една страна, и вториот и третиот број, од друга страна:
d = |(a-b)| + |(b-c)|
Да се напише програма со којашто од тастатура се вчитуваат N тројки цели броеви (N се внесува од тастатура),
и која што ја наоѓа и ја печати најмалата вредност за d од прочитаните тројки.

Да не се користи библиотеката <cmath>, да се дефинира посебна функција која како аргумент ќе прима цел број
и ќе ја враќа апсолутната вредност на тој број.

За пресметка на вредност на бројот d да се повикува посебна функција која како аргументи ќе прима
тројка цели броеви, а ќе ја враќа вредноста  d
Input:
3
1 2 3
22 30 22
1 1 1
Result:
0

Објаснување:
За тројката 1 2 3 вредноста d е: |(1-2)| + (2-3)| = 2
За тројката 22 30 22 вредноста d е: |(22-30)| + |(30-22)| = 16
За тројката 1 1 1 вредноста d е: |(1-1)| + |(1-1)| = 0
Најмала вредност d: 0
For example:
Input: 5
1 21 3
5 8 4
2 1 9
21 42 81
2 5 2

Result:
6

 */
//
#include <iostream>
using namespace std;

int main() {
    cout<<"Hello world!"<<endl;
}