//
// Created by jakim on 12/7/2025.
/*
Во играта Бинго по редослед се извлекуваат непознат број броеви со вредности помеѓу 1 и 90.
Секогаш се извлекуваат повеќе од 8 броја. Претпоставете дека внесувањето престанува кога ќе се внесе број
кој не е во опсегот вредности.
Освен главната добивка, играчите играат и на џокер број.
Џокер бројот се формира на следниот начин: Се слепуваат помалку значајните цифри од првите 7 извлечени броја,
и на тој број се додаваат сите следни внесени броеви. Ваша задача е да го отпечатите така добиениот џокер број.

Читањето на броеви да се прави во посебна функција која нема да прима аргументи а ќе го враќа џокер бројот.

For example:
Input: 2 32 45 78 64 21 7 65 18 32 88 1 99
Result: 2258621

 */
//
#include "iostream"
using namespace std;

int main(){
    cout<<"Hello"<<endl;
}