//
// Created by jakim on 12/6/2025.
/*
Да се креира програма која што за вчитан датум од стандарден влез (во формат DD MM GGGG)
ќе испечати на стандарден излез порака DA или NE во зависност од тоа дали внесениот датум е правилен или не.
При одредување на валидноста на датумот во предвид да се земат сите фактори:
    • дали месецот е број помеѓу 1 и 12
    • дали денот одговара со бројот на денови во тој месец
    • доколку е 29.02. да се внимава дали станува збор за престапна година
        ◦ престапна година е секоја година која што е делива со 400 или пак е делива со 4, но не и со 100.
For example:
Input: 29 02 2140
Result
DA

 */
//
#include "iostream"
using namespace std;

int main(){
    int den, mesec, godina;
    //meseci so 31 den - 1, 3, 5, 7, 8, 10, 12
    //meseci so 30 dena 4, 6, 9, 11
    //februari 28 (29 vo prestapna godina)

}