//
// Created by jakim on 12/6/2025.
/*
Пресметајте ја цената за електрична енергија која еден корисник треба да ја плати,
во зависност од тоа колку kWh потрошил. За помалку 500 kWh се наплаќа 5 ден/kWh.
Ако трошокот ја надмине оваа граница, тогаш за наредните 150 kWh се наплаќа 7.5 ден/kWh,
а наредните 200 kWh се наплаќа 11 ден/kWh, а за секој трошок над тоа се доплаќа уште 13.5 ден/kWh.
На крајот на сметката се додава 10% ДДВ доколку изнесува 7000 денари или помалку, додека ако
изнесува повеќе од тоа, се додава 18% ДДВ.
For example:
Input 1000
Result
9263.00

 */
//
